import xml.etree.ElementTree as ET
import openpyxl as opx


def FormatDate(date):
    dates = date.split(" ")

    datel = ("января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября",
             "октября", "ноября", "декабря")

    month = datel.index(dates[1].lower()) + 1

    return dates[0] + ("0" + str(month) if len(str(month)) < 2 else str(month)) + dates[2]


def GetKKT():
    xml = ET.parse('./stuff/models.list')
    return tuple((model.text for model in xml.findall('Models/Model')))


def GetFN():
    FN = ET.parse("./stuff/fns.list")
    FNList = {}
    for i in FN.findall("FN"):
        FNList[i.find("Model").text] = [i.find(f'String{j}').text for j in range(1, 7)]

    return FNList


def GetRegions():
    rg = ET.parse("./stuff/regions.list")
    rglist = []
    for i in rg.findall("Regions"):
        rglist.append(i.find("Code").text + " " + i.find("Name").text)

    return rglist


def GetOFD():
    ofd = ET.parse("./stuff/ofd.list")
    ofdlist = {}
    for i in ofd.findall("OFD"):
        ofdlist[i.find("Name").text] = [i.find(f"String{j}").text for j in range(1, 5)], i.find("INN").text
    return ofdlist


def excelwork(data, path):
    if data["Primary"]["TypeDock"] == "Снятие с учета":
        f = opx.load_workbook("./stuff/1.xlsx")
    elif data["NumberOfSheets"][0]:
        f = opx.load_workbook("./stuff/4.xlsx")
    else:
        f = opx.load_workbook("./stuff/2.xlsx")

    c = 0
    for i in f.sheetnames:
        c += 1
        f[i]["BX6"].value = "0"
        f[i]["CA6"].value = str(c)[0] if len(str(c)) == 2 else "0"
        f[i]["CD6"].value = str(c)[1] if len(str(c)) == 2 else str(c)

        ogrnl = (f[i]["AN1"], f[i]["AQ1"], f[i]["AT1"], f[i]["AW1"],
                 f[i]["AZ1"], f[i]["BC1"], f[i]["BF1"], f[i]["BI1"],
                 f[i]["BL1"], f[i]["BO1"], f[i]["BR1"], f[i]["BU1"],
                 f[i]["BX1"], f[i]["CA1"], f[i]["CD1"])

        for _ in range(len(data["Primary"]["OGRN"])):
            ogrnl[_].value = data["Primary"]["OGRN"][_]

        innl = (f[i]["AN4"], f[i]["AQ4"], f[i]["AT4"], f[i]["AW4"],
                f[i]["AZ4"], f[i]["BC4"], f[i]["BF4"], f[i]["BI4"],
                f[i]["BL4"], f[i]["BO4"], f[i]["BR4"], f[i]["BU4"])

        for _ in range(len(data["Primary"]["INN"])):
            innl[_].value = data["Primary"]["INN"][_]

        kppl = (f[i]["AN6"], f[i]["AQ6"], f[i]["AT6"], f[i]["AW6"],
                f[i]["AZ6"], f[i]["BC6"], f[i]["BF6"], f[i]["BI6"],
                f[i]["BL6"])

        for _ in range(len(data["Primary"]["KPP"])):
            kppl[_].value = data["Primary"]["KPP"][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        f["стр.1"]["AA12"].value = "1" if data["Primary"]["TypeDock"] == "Регистрация" else "2"

    if data["Primary"]["TypeDock"] == "Перерегистрация":
        resonsl = (f["стр.1"]["AG15"], f["стр.1"]["AM15"], f["стр.1"]["AS15"], f["стр.1"]["AY15"],
                   f["стр.1"]["BE15"], f["стр.1"]["BK15"], f["стр.1"]["BQ15"], f["стр.1"]["BW15"])
        for _ in range(len(data["Primary"]["Resons"])):
            resonsl[_].value = "1" if data["Primary"]["Resons"][_] else "2"

        regn = data["Primary"]["CurKkt"].split("/")
        n = regn[0]
        if len(n) < 20:
            while len(n) != 20:
                n += " "
        regnl = (f["стр.2"]["V21"], f["стр.2"]["Y21"], f["стр.2"]["AB21"], f["стр.2"]["AE21"],
                 f["стр.2"]["AH21"], f["стр.2"]["AK21"], f["стр.2"]["AN21"], f["стр.2"]["AQ21"],
                 f["стр.2"]["AT21"], f["стр.2"]["AW21"], f["стр.2"]["AZ21"], f["стр.2"]["BC21"],
                 f["стр.2"]["BF21"], f["стр.2"]["BI21"], f["стр.2"]["BL21"], f["стр.2"]["BO21"],
                 f["стр.2"]["BR21"], f["стр.2"]["BU21"], f["стр.2"]["BX21"], f["стр.2"]["CA21"])

        for _ in range(len(n)):
            regnl[_].value = n[_]

        regd = FormatDate(regn[1])

        datel = (f["стр.2"]["CM21"], f["стр.2"]["CP21"], f["стр.2"]["CV21"], f["стр.2"]["CY21"],
                 f["стр.2"]["DE21"], f["стр.2"]["DH21"], f["стр.2"]["DK21"], f["стр.2"]["DN21"])

        for _ in range(len(regd)):
            datel[_].value = regd[_]
    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        fname1 = (f["стр.1"]["A17"], f["стр.1"]["D17"], f["стр.1"]["G17"], f["стр.1"]["J17"],
                  f["стр.1"]["M17"], f["стр.1"]["P17"], f["стр.1"]["S17"], f["стр.1"]["V17"],
                  f["стр.1"]["Y17"], f["стр.1"]["AB17"], f["стр.1"]["AE17"], f["стр.1"]["AH17"],
                  f["стр.1"]["AK17"], f["стр.1"]["AN17"], f["стр.1"]["AQ17"], f["стр.1"]["AT17"],
                  f["стр.1"]["AW17"], f["стр.1"]["AZ17"], f["стр.1"]["BC17"], f["стр.1"]["BF17"],
                  f["стр.1"]["BI17"], f["стр.1"]["BL17"], f["стр.1"]["BO17"], f["стр.1"]["BR17"],
                  f["стр.1"]["BU17"], f["стр.1"]["BX17"], f["стр.1"]["CA17"], f["стр.1"]["CD17"],
                  f["стр.1"]["CG17"], f["стр.1"]["CJ17"], f["стр.1"]["CM17"], f["стр.1"]["CP17"],
                  f["стр.1"]["CS17"], f["стр.1"]["CV17"], f["стр.1"]["CY17"], f["стр.1"]["DB17"],
                  f["стр.1"]["DE17"], f["стр.1"]["DH17"], f["стр.1"]["DK17"], f["стр.1"]["DN17"])
    else:
        fname1 = (f["стр.1"]["A12"], f["стр.1"]["D12"], f["стр.1"]["G12"], f["стр.1"]["J12"],
                  f["стр.1"]["M12"], f["стр.1"]["P12"], f["стр.1"]["S12"], f["стр.1"]["V12"],
                  f["стр.1"]["Y12"], f["стр.1"]["AB12"], f["стр.1"]["AE12"], f["стр.1"]["AH12"],
                  f["стр.1"]["AK12"], f["стр.1"]["AN12"], f["стр.1"]["AQ12"], f["стр.1"]["AT12"],
                  f["стр.1"]["AW12"], f["стр.1"]["AZ12"], f["стр.1"]["BC12"], f["стр.1"]["BF12"],
                  f["стр.1"]["BI12"], f["стр.1"]["BL12"], f["стр.1"]["BO12"], f["стр.1"]["BR12"],
                  f["стр.1"]["BU12"], f["стр.1"]["BX12"], f["стр.1"]["CA12"], f["стр.1"]["CD12"],
                  f["стр.1"]["CG12"], f["стр.1"]["CJ12"], f["стр.1"]["CM12"], f["стр.1"]["CP12"],
                  f["стр.1"]["CS12"], f["стр.1"]["CV12"], f["стр.1"]["CY12"], f["стр.1"]["DB12"],
                  f["стр.1"]["DE12"], f["стр.1"]["DH12"], f["стр.1"]["DK12"], f["стр.1"]["DN12"])

    for _ in range(len(data["Primary"]["FullName"][0])):
        fname1[_].value = data["Primary"]["FullName"][0][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        fname2 = (f["стр.1"]["A19"], f["стр.1"]["D19"], f["стр.1"]["G19"], f["стр.1"]["J19"],
                  f["стр.1"]["M19"], f["стр.1"]["P19"], f["стр.1"]["S19"], f["стр.1"]["V19"],
                  f["стр.1"]["Y19"], f["стр.1"]["AB19"], f["стр.1"]["AE19"], f["стр.1"]["AH19"],
                  f["стр.1"]["AK19"], f["стр.1"]["AN19"], f["стр.1"]["AQ19"], f["стр.1"]["AT19"],
                  f["стр.1"]["AW19"], f["стр.1"]["AZ19"], f["стр.1"]["BC19"], f["стр.1"]["BF19"],
                  f["стр.1"]["BI19"], f["стр.1"]["BL19"], f["стр.1"]["BO19"], f["стр.1"]["BR19"],
                  f["стр.1"]["BU19"], f["стр.1"]["BX19"], f["стр.1"]["CA19"], f["стр.1"]["CD19"],
                  f["стр.1"]["CG19"], f["стр.1"]["CJ19"], f["стр.1"]["CM19"], f["стр.1"]["CP19"],
                  f["стр.1"]["CS19"], f["стр.1"]["CV19"], f["стр.1"]["CY19"], f["стр.1"]["DB19"],
                  f["стр.1"]["DE19"], f["стр.1"]["DH19"], f["стр.1"]["DK19"], f["стр.1"]["DN19"])
    else:
        fname2 = (f["стр.1"]["A14"], f["стр.1"]["D14"], f["стр.1"]["G14"], f["стр.1"]["J14"],
                  f["стр.1"]["M14"], f["стр.1"]["P14"], f["стр.1"]["S14"], f["стр.1"]["V14"],
                  f["стр.1"]["Y14"], f["стр.1"]["AB14"], f["стр.1"]["AE14"], f["стр.1"]["AH14"],
                  f["стр.1"]["AK14"], f["стр.1"]["AN14"], f["стр.1"]["AQ14"], f["стр.1"]["AT14"],
                  f["стр.1"]["AW14"], f["стр.1"]["AZ14"], f["стр.1"]["BC14"], f["стр.1"]["BF14"],
                  f["стр.1"]["BI14"], f["стр.1"]["BL14"], f["стр.1"]["BO14"], f["стр.1"]["BR14"],
                  f["стр.1"]["BU14"], f["стр.1"]["BX14"], f["стр.1"]["CA14"], f["стр.1"]["CD14"],
                  f["стр.1"]["CG14"], f["стр.1"]["CJ14"], f["стр.1"]["CM14"], f["стр.1"]["CP14"],
                  f["стр.1"]["CS14"], f["стр.1"]["CV14"], f["стр.1"]["CY14"], f["стр.1"]["DB14"],
                  f["стр.1"]["DE14"], f["стр.1"]["DH14"], f["стр.1"]["DK14"], f["стр.1"]["DN14"])

    for _ in range(len(data["Primary"]["FullName"][1])):
        fname2[_].value = data["Primary"]["FullName"][1][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        fname3 = (f["стр.1"]["A21"], f["стр.1"]["D21"], f["стр.1"]["G21"], f["стр.1"]["J21"],
                  f["стр.1"]["M21"], f["стр.1"]["P21"], f["стр.1"]["S21"], f["стр.1"]["V21"],
                  f["стр.1"]["Y21"], f["стр.1"]["AB21"], f["стр.1"]["AE21"], f["стр.1"]["AH21"],
                  f["стр.1"]["AK21"], f["стр.1"]["AN21"], f["стр.1"]["AQ21"], f["стр.1"]["AT21"],
                  f["стр.1"]["AW21"], f["стр.1"]["AZ21"], f["стр.1"]["BC21"], f["стр.1"]["BF21"],
                  f["стр.1"]["BI21"], f["стр.1"]["BL21"], f["стр.1"]["BO21"], f["стр.1"]["BR21"],
                  f["стр.1"]["BU21"], f["стр.1"]["BX21"], f["стр.1"]["CA21"], f["стр.1"]["CD21"],
                  f["стр.1"]["CG21"], f["стр.1"]["CJ21"], f["стр.1"]["CM21"], f["стр.1"]["CP21"],
                  f["стр.1"]["CS21"], f["стр.1"]["CV21"], f["стр.1"]["CY21"], f["стр.1"]["DB21"],
                  f["стр.1"]["DE21"], f["стр.1"]["DH21"], f["стр.1"]["DK21"], f["стр.1"]["DN21"])
    else:
        fname3 = (f["стр.1"]["A16"], f["стр.1"]["D16"], f["стр.1"]["G16"], f["стр.1"]["J16"],
                  f["стр.1"]["M16"], f["стр.1"]["P16"], f["стр.1"]["S16"], f["стр.1"]["V16"],
                  f["стр.1"]["Y16"], f["стр.1"]["AB16"], f["стр.1"]["AE16"], f["стр.1"]["AH16"],
                  f["стр.1"]["AK16"], f["стр.1"]["AN16"], f["стр.1"]["AQ16"], f["стр.1"]["AT16"],
                  f["стр.1"]["AW16"], f["стр.1"]["AZ16"], f["стр.1"]["BC16"], f["стр.1"]["BF16"],
                  f["стр.1"]["BI16"], f["стр.1"]["BL16"], f["стр.1"]["BO16"], f["стр.1"]["BR16"],
                  f["стр.1"]["BU16"], f["стр.1"]["BX16"], f["стр.1"]["CA16"], f["стр.1"]["CD16"],
                  f["стр.1"]["CG16"], f["стр.1"]["CJ16"], f["стр.1"]["CM16"], f["стр.1"]["CP16"],
                  f["стр.1"]["CS16"], f["стр.1"]["CV16"], f["стр.1"]["CY16"], f["стр.1"]["DB16"],
                  f["стр.1"]["DE16"], f["стр.1"]["DH16"], f["стр.1"]["DK16"], f["стр.1"]["DN16"])

    for _ in range(len(data["Primary"]["FullName"][2])):
        fname3[_].value = data["Primary"]["FullName"][2][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        if data["NumberOfSheets"][1]:
            f["стр.1"]["AJ26"].value, f["стр.1"]["AM26"].value, f["стр.1"]["AP26"].value = "0", "1", "0"
            f["стр.1"]["N28"].value, f["стр.1"]["Q28"].value, f["стр.1"]["T28"].value = "0", "1", "0"

        else:
            f["стр.1"]["AJ26"].value, f["стр.1"]["AM26"].value, f["стр.1"]["AP26"].value = "0", "0", "8"
            f["стр.1"]["N28"].value, f["стр.1"]["Q28"].value, f["стр.1"]["T28"].value = "0", "0", "8"

        f["стр.1"]["B33"].value = "1" if data["Primary"]["User"] == "Пользователь" else "2"

    else:
        f["стр.1"]["AJ32"].value, f["стр.1"]["AM32"].value, f["стр.1"]["AP32"].value = "0", "0", "3"
        f["стр.1"]["N34"].value, f["стр.1"]["Q34"].value, f["стр.1"]["T34"].value = "0", "0", "3"

        f["стр.1"]["B39"].value = "1" if data["Primary"]["User"] == "Пользователь" else "2"

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        userfio1 = (f["стр.1"]["A36"], f["стр.1"]["D36"], f["стр.1"]["G36"], f["стр.1"]["J36"],
                    f["стр.1"]["M36"], f["стр.1"]["P36"], f["стр.1"]["S36"], f["стр.1"]["V36"],
                    f["стр.1"]["Y36"], f["стр.1"]["AB36"], f["стр.1"]["AE36"], f["стр.1"]["AH36"],
                    f["стр.1"]["AK36"], f["стр.1"]["AN36"], f["стр.1"]["AQ36"], f["стр.1"]["AT36"],
                    f["стр.1"]["AW36"], f["стр.1"]["AZ36"], f["стр.1"]["BC36"], f["стр.1"]["BF36"])
    else:
        userfio1 = (f["стр.1"]["A42"], f["стр.1"]["D42"], f["стр.1"]["G42"], f["стр.1"]["J42"],
                    f["стр.1"]["M42"], f["стр.1"]["P42"], f["стр.1"]["S42"], f["стр.1"]["V42"],
                    f["стр.1"]["Y42"], f["стр.1"]["AB42"], f["стр.1"]["AE42"], f["стр.1"]["AH42"],
                    f["стр.1"]["AK42"], f["стр.1"]["AN42"], f["стр.1"]["AQ42"], f["стр.1"]["AT42"],
                    f["стр.1"]["AW42"], f["стр.1"]["AZ42"], f["стр.1"]["BC42"], f["стр.1"]["BF42"])

    for _ in range(len(data["Primary"]["UserFIO"][0])):
        userfio1[_].value = data["Primary"]["UserFIO"][0][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        userfio2 = (f["стр.1"]["A38"], f["стр.1"]["D38"], f["стр.1"]["G38"], f["стр.1"]["J38"],
                    f["стр.1"]["M38"], f["стр.1"]["P38"], f["стр.1"]["S38"], f["стр.1"]["V38"],
                    f["стр.1"]["Y38"], f["стр.1"]["AB38"], f["стр.1"]["AE38"], f["стр.1"]["AH38"],
                    f["стр.1"]["AK38"], f["стр.1"]["AN38"], f["стр.1"]["AQ38"], f["стр.1"]["AT38"],
                    f["стр.1"]["AW38"], f["стр.1"]["AZ38"], f["стр.1"]["BC38"], f["стр.1"]["BF38"])
    else:
        userfio2 = (f["стр.1"]["A44"], f["стр.1"]["D44"], f["стр.1"]["G44"], f["стр.1"]["J44"],
                    f["стр.1"]["M44"], f["стр.1"]["P44"], f["стр.1"]["S44"], f["стр.1"]["V44"],
                    f["стр.1"]["Y44"], f["стр.1"]["AB44"], f["стр.1"]["AE44"], f["стр.1"]["AH44"],
                    f["стр.1"]["AK44"], f["стр.1"]["AN44"], f["стр.1"]["AQ44"], f["стр.1"]["AT44"],
                    f["стр.1"]["AW44"], f["стр.1"]["AZ44"], f["стр.1"]["BC44"], f["стр.1"]["BF44"])

    for _ in range(len(data["Primary"]["UserFIO"][1])):
        userfio2[_].value = data["Primary"]["UserFIO"][1][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        userfio3 = (f["стр.1"]["A40"], f["стр.1"]["D40"], f["стр.1"]["G40"], f["стр.1"]["J40"],
                    f["стр.1"]["M40"], f["стр.1"]["P40"], f["стр.1"]["S40"], f["стр.1"]["V40"],
                    f["стр.1"]["Y40"], f["стр.1"]["AB40"], f["стр.1"]["AE40"], f["стр.1"]["AH40"],
                    f["стр.1"]["AK40"], f["стр.1"]["AN40"], f["стр.1"]["AQ40"], f["стр.1"]["AT40"],
                    f["стр.1"]["AW40"], f["стр.1"]["AZ40"], f["стр.1"]["BC40"], f["стр.1"]["BF40"])
    else:
        userfio3 = (f["стр.1"]["A46"], f["стр.1"]["D46"], f["стр.1"]["G46"], f["стр.1"]["J46"],
                    f["стр.1"]["M46"], f["стр.1"]["P46"], f["стр.1"]["S46"], f["стр.1"]["V46"],
                    f["стр.1"]["Y46"], f["стр.1"]["AB46"], f["стр.1"]["AE46"], f["стр.1"]["AH46"],
                    f["стр.1"]["AK46"], f["стр.1"]["AN46"], f["стр.1"]["AQ46"], f["стр.1"]["AT46"],
                    f["стр.1"]["AW46"], f["стр.1"]["AZ46"], f["стр.1"]["BC46"], f["стр.1"]["BF46"])

    for _ in range(len(data["Primary"]["UserFIO"][2])):
        userfio3[_].value = data["Primary"]["UserFIO"][2][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        datedock = (f["стр.1"]["AB45"], f["стр.1"]["AE45"], f["стр.1"]["AK45"], f["стр.1"]["AN45"],
                    f["стр.1"]["AT45"], f["стр.1"]["AW45"], f["стр.1"]["AZ45"], f["стр.1"]["BC45"])

    else:
        datedock = (f["стр.1"]["AB51"], f["стр.1"]["AE51"], f["стр.1"]["AK51"], f["стр.1"]["AN51"],
                    f["стр.1"]["AT51"], f["стр.1"]["AW51"], f["стр.1"]["AZ51"], f["стр.1"]["BC51"])

    dated = FormatDate(data["Primary"]["DateDock"])

    for _ in range(len(dated)):
        datedock[_].value = dated[_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        dockinfo1 = (f["стр.2"]["A12"], f["стр.2"]["D12"], f["стр.2"]["G12"], f["стр.2"]["J12"],
                     f["стр.2"]["M12"], f["стр.2"]["P12"], f["стр.2"]["S12"], f["стр.2"]["V12"],
                     f["стр.2"]["Y12"], f["стр.2"]["AB12"], f["стр.2"]["AE12"], f["стр.2"]["AH12"],
                     f["стр.2"]["AK12"], f["стр.2"]["AN12"], f["стр.2"]["AQ12"], f["стр.2"]["AT12"],
                     f["стр.2"]["AW12"], f["стр.2"]["AZ12"], f["стр.2"]["BC12"], f["стр.2"]["BF12"])
    else:
        dockinfo1 = (f["стр.2"]["A11"], f["стр.2"]["D11"], f["стр.2"]["G11"], f["стр.2"]["J11"],
                     f["стр.2"]["M11"], f["стр.2"]["P11"], f["стр.2"]["S11"], f["стр.2"]["V11"],
                     f["стр.2"]["Y11"], f["стр.2"]["AB11"], f["стр.2"]["AE11"], f["стр.2"]["AH11"],
                     f["стр.2"]["AK11"], f["стр.2"]["AN11"], f["стр.2"]["AQ11"], f["стр.2"]["AT11"],
                     f["стр.2"]["AW11"], f["стр.2"]["AZ11"], f["стр.2"]["BC11"], f["стр.2"]["BF11"])

    for _ in range(len(data["Primary"]["Document"][0])):
        dockinfo1[_].value = data["Primary"]["Document"][0][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        dockinfo2 = (f["стр.2"]["A14"], f["стр.2"]["D14"], f["стр.2"]["G14"], f["стр.2"]["J14"],
                     f["стр.2"]["M14"], f["стр.2"]["P14"], f["стр.2"]["S14"], f["стр.2"]["V14"],
                     f["стр.2"]["Y14"], f["стр.2"]["AB14"], f["стр.2"]["AE14"], f["стр.2"]["AH14"],
                     f["стр.2"]["AK14"], f["стр.2"]["AN14"], f["стр.2"]["AQ14"], f["стр.2"]["AT14"],
                     f["стр.2"]["AW14"], f["стр.2"]["AZ14"], f["стр.2"]["BC14"], f["стр.2"]["BF14"])
    else:
        dockinfo2 = (f["стр.2"]["A13"], f["стр.2"]["D13"], f["стр.2"]["G13"], f["стр.2"]["J13"],
                     f["стр.2"]["M13"], f["стр.2"]["P13"], f["стр.2"]["S13"], f["стр.2"]["V13"],
                     f["стр.2"]["Y13"], f["стр.2"]["AB13"], f["стр.2"]["AE13"], f["стр.2"]["AH13"],
                     f["стр.2"]["AK13"], f["стр.2"]["AN13"], f["стр.2"]["AQ13"], f["стр.2"]["AT13"],
                     f["стр.2"]["AW13"], f["стр.2"]["AZ13"], f["стр.2"]["BC13"], f["стр.2"]["BF13"])

    for _ in range(len(data["Primary"]["Document"][1])):
        dockinfo2[_].value = data["Primary"]["Document"][1][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        dockinfo3 = (f["стр.2"]["A16"], f["стр.2"]["D16"], f["стр.2"]["G16"], f["стр.2"]["J16"],
                     f["стр.2"]["M16"], f["стр.2"]["P16"], f["стр.2"]["S16"], f["стр.2"]["V16"],
                     f["стр.2"]["Y16"], f["стр.2"]["AB16"], f["стр.2"]["AE16"], f["стр.2"]["AH16"],
                     f["стр.2"]["AK16"], f["стр.2"]["AN16"], f["стр.2"]["AQ16"], f["стр.2"]["AT16"],
                     f["стр.2"]["AW16"], f["стр.2"]["AZ16"], f["стр.2"]["BC16"], f["стр.2"]["BF16"])
    else:
        dockinfo3 = (f["стр.2"]["A15"], f["стр.2"]["D15"], f["стр.2"]["G15"], f["стр.2"]["J15"],
                     f["стр.2"]["M15"], f["стр.2"]["P15"], f["стр.2"]["S15"], f["стр.2"]["V15"],
                     f["стр.2"]["Y15"], f["стр.2"]["AB15"], f["стр.2"]["AE15"], f["стр.2"]["AH15"],
                     f["стр.2"]["AK15"], f["стр.2"]["AN15"], f["стр.2"]["AQ15"], f["стр.2"]["AT15"],
                     f["стр.2"]["AW15"], f["стр.2"]["AZ15"], f["стр.2"]["BC15"], f["стр.2"]["BF15"])

    for _ in range(len(data["Primary"]["Document"][2])):
        dockinfo3[_].value = data["Primary"]["Document"][2][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        KKTmodel = (f["стр.3_Разд.1"]["BC13"], f["стр.3_Разд.1"]["BF13"], f["стр.3_Разд.1"]["BI13"],
                    f["стр.3_Разд.1"]["BL13"], f["стр.3_Разд.1"]["BO13"], f["стр.3_Разд.1"]["BR13"],
                    f["стр.3_Разд.1"]["BU13"], f["стр.3_Разд.1"]["BX13"], f["стр.3_Разд.1"]["CA13"],
                    f["стр.3_Разд.1"]["CD13"], f["стр.3_Разд.1"]["CG13"], f["стр.3_Разд.1"]["CJ13"],
                    f["стр.3_Разд.1"]["CM13"], f["стр.3_Разд.1"]["CP13"], f["стр.3_Разд.1"]["CS13"],
                    f["стр.3_Разд.1"]["CV13"], f["стр.3_Разд.1"]["CY13"], f["стр.3_Разд.1"]["DB13"],
                    f["стр.3_Разд.1"]["DE13"], f["стр.3_Разд.1"]["DH13"])
    else:
        KKTmodel = (f["стр.1"]["BC22"], f["стр.1"]["BF22"], f["стр.1"]["BI22"],
                    f["стр.1"]["BL22"], f["стр.1"]["BO22"], f["стр.1"]["BR22"],
                    f["стр.1"]["BU22"], f["стр.1"]["BX22"], f["стр.1"]["CA22"],
                    f["стр.1"]["CD22"], f["стр.1"]["CG22"], f["стр.1"]["CJ22"],
                    f["стр.1"]["CM22"], f["стр.1"]["CP22"], f["стр.1"]["CS22"],
                    f["стр.1"]["CV22"], f["стр.1"]["CY22"], f["стр.1"]["DB22"],
                    f["стр.1"]["DE22"], f["стр.1"]["DH22"])

    for _ in range(len(data["KKTandFN"]["Model"])):
        KKTmodel[_].value = data["KKTandFN"]["Model"][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        KKTs = (f["стр.3_Разд.1"]["BC17"], f["стр.3_Разд.1"]["BF17"], f["стр.3_Разд.1"]["BI17"],
                f["стр.3_Разд.1"]["BL17"], f["стр.3_Разд.1"]["BO17"], f["стр.3_Разд.1"]["BR17"],
                f["стр.3_Разд.1"]["BU17"], f["стр.3_Разд.1"]["BX17"], f["стр.3_Разд.1"]["CA17"],
                f["стр.3_Разд.1"]["CD17"], f["стр.3_Разд.1"]["CG17"], f["стр.3_Разд.1"]["CJ17"],
                f["стр.3_Разд.1"]["CM17"], f["стр.3_Разд.1"]["CP17"], f["стр.3_Разд.1"]["CS17"],
                f["стр.3_Разд.1"]["CV17"], f["стр.3_Разд.1"]["CY17"], f["стр.3_Разд.1"]["DB17"],
                f["стр.3_Разд.1"]["DE17"], f["стр.3_Разд.1"]["DH17"])
    else:
        KKTs = (f["стр.1"]["BC24"], f["стр.1"]["BF24"], f["стр.1"]["BI24"],
                f["стр.1"]["BL24"], f["стр.1"]["BO24"], f["стр.1"]["BR24"],
                f["стр.1"]["BU24"], f["стр.1"]["BX24"], f["стр.1"]["CA24"],
                f["стр.1"]["CD24"], f["стр.1"]["CG24"], f["стр.1"]["CJ24"],
                f["стр.1"]["CM24"], f["стр.1"]["CP24"], f["стр.1"]["CS24"],
                f["стр.1"]["CV24"], f["стр.1"]["CY24"], f["стр.1"]["DB24"],
                f["стр.1"]["DE24"], f["стр.1"]["DH24"])

    for _ in range(len(data["KKTandFN"]["SerialKKT"])):
        KKTs[_].value = data["KKTandFN"]["SerialKKT"][_]

    if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
        FNname1 = (f["стр.3_Разд.1"]["BC21"], f["стр.3_Разд.1"]["BF21"], f["стр.3_Разд.1"]["BI21"],
                   f["стр.3_Разд.1"]["BL21"], f["стр.3_Разд.1"]["BO21"], f["стр.3_Разд.1"]["BR21"],
                   f["стр.3_Разд.1"]["BU21"], f["стр.3_Разд.1"]["BX21"], f["стр.3_Разд.1"]["CA21"],
                   f["стр.3_Разд.1"]["CD21"], f["стр.3_Разд.1"]["CG21"], f["стр.3_Разд.1"]["CJ21"],
                   f["стр.3_Разд.1"]["CM21"], f["стр.3_Разд.1"]["CP21"], f["стр.3_Разд.1"]["CS21"],
                   f["стр.3_Разд.1"]["CV21"], f["стр.3_Разд.1"]["CY21"], f["стр.3_Разд.1"]["DB21"],
                   f["стр.3_Разд.1"]["DE21"], f["стр.3_Разд.1"]["DH21"])

        for _ in range(len(data["KKTandFN"]["FNName"][0])):
            FNname1[_].value = data["KKTandFN"]["FNName"][0][_]

        FNname2 = (f["стр.3_Разд.1"]["BC23"], f["стр.3_Разд.1"]["BF23"], f["стр.3_Разд.1"]["BI23"],
                   f["стр.3_Разд.1"]["BL23"], f["стр.3_Разд.1"]["BO23"], f["стр.3_Разд.1"]["BR23"],
                   f["стр.3_Разд.1"]["BU23"], f["стр.3_Разд.1"]["BX23"], f["стр.3_Разд.1"]["CA23"],
                   f["стр.3_Разд.1"]["CD23"], f["стр.3_Разд.1"]["CG23"], f["стр.3_Разд.1"]["CJ23"],
                   f["стр.3_Разд.1"]["CM23"], f["стр.3_Разд.1"]["CP23"], f["стр.3_Разд.1"]["CS23"],
                   f["стр.3_Разд.1"]["CV23"], f["стр.3_Разд.1"]["CY23"], f["стр.3_Разд.1"]["DB23"],
                   f["стр.3_Разд.1"]["DE23"], f["стр.3_Разд.1"]["DH23"])

        for _ in range(len(data["KKTandFN"]["FNName"][1])):
            FNname2[_].value = data["KKTandFN"]["FNName"][1][_]

        FNname3 = (f["стр.3_Разд.1"]["BC25"], f["стр.3_Разд.1"]["BF25"], f["стр.3_Разд.1"]["BI25"],
                   f["стр.3_Разд.1"]["BL25"], f["стр.3_Разд.1"]["BO25"], f["стр.3_Разд.1"]["BR25"],
                   f["стр.3_Разд.1"]["BU25"], f["стр.3_Разд.1"]["BX25"], f["стр.3_Разд.1"]["CA25"],
                   f["стр.3_Разд.1"]["CD25"], f["стр.3_Разд.1"]["CG25"], f["стр.3_Разд.1"]["CJ25"],
                   f["стр.3_Разд.1"]["CM25"], f["стр.3_Разд.1"]["CP25"], f["стр.3_Разд.1"]["CS25"],
                   f["стр.3_Разд.1"]["CV25"], f["стр.3_Разд.1"]["CY25"], f["стр.3_Разд.1"]["DB25"],
                   f["стр.3_Разд.1"]["DE25"], f["стр.3_Разд.1"]["DH25"])

        for _ in range(len(data["KKTandFN"]["FNName"][2])):
            FNname3[_].value = data["KKTandFN"]["FNName"][2][_]

        FNname4 = (f["стр.3_Разд.1"]["BC27"], f["стр.3_Разд.1"]["BF27"], f["стр.3_Разд.1"]["BI27"],
                   f["стр.3_Разд.1"]["BL27"], f["стр.3_Разд.1"]["BO27"], f["стр.3_Разд.1"]["BR27"],
                   f["стр.3_Разд.1"]["BU27"], f["стр.3_Разд.1"]["BX27"], f["стр.3_Разд.1"]["CA27"],
                   f["стр.3_Разд.1"]["CD27"], f["стр.3_Разд.1"]["CG27"], f["стр.3_Разд.1"]["CJ27"],
                   f["стр.3_Разд.1"]["CM27"], f["стр.3_Разд.1"]["CP27"], f["стр.3_Разд.1"]["CS27"],
                   f["стр.3_Разд.1"]["CV27"], f["стр.3_Разд.1"]["CY27"], f["стр.3_Разд.1"]["DB27"],
                   f["стр.3_Разд.1"]["DE27"], f["стр.3_Разд.1"]["DH27"])

        for _ in range(len(data["KKTandFN"]["FNName"][3])):
            FNname4[_].value = data["KKTandFN"]["FNName"][3][_]

        FNname5 = (f["стр.3_Разд.1"]["BC29"], f["стр.3_Разд.1"]["BF29"], f["стр.3_Разд.1"]["BI29"],
                   f["стр.3_Разд.1"]["BL29"], f["стр.3_Разд.1"]["BO29"], f["стр.3_Разд.1"]["BR29"],
                   f["стр.3_Разд.1"]["BU29"], f["стр.3_Разд.1"]["BX29"], f["стр.3_Разд.1"]["CA29"],
                   f["стр.3_Разд.1"]["CD29"], f["стр.3_Разд.1"]["CG29"], f["стр.3_Разд.1"]["CJ29"],
                   f["стр.3_Разд.1"]["CM29"], f["стр.3_Разд.1"]["CP29"], f["стр.3_Разд.1"]["CS29"],
                   f["стр.3_Разд.1"]["CV29"], f["стр.3_Разд.1"]["CY29"], f["стр.3_Разд.1"]["DB29"],
                   f["стр.3_Разд.1"]["DE29"], f["стр.3_Разд.1"]["DH29"])

        for _ in range(len(data["KKTandFN"]["FNName"][4])):
            FNname5[_].value = data["KKTandFN"]["FNName"][4][_]

        FNname6 = (f["стр.3_Разд.1"]["BC31"], f["стр.3_Разд.1"]["BF31"], f["стр.3_Разд.1"]["BI31"],
                   f["стр.3_Разд.1"]["BL31"], f["стр.3_Разд.1"]["BO31"], f["стр.3_Разд.1"]["BR31"],
                   f["стр.3_Разд.1"]["BU31"], f["стр.3_Разд.1"]["BX31"], f["стр.3_Разд.1"]["CA31"],
                   f["стр.3_Разд.1"]["CD31"], f["стр.3_Разд.1"]["CG31"], f["стр.3_Разд.1"]["CJ31"],
                   f["стр.3_Разд.1"]["CM31"], f["стр.3_Разд.1"]["CP31"], f["стр.3_Разд.1"]["CS31"],
                   f["стр.3_Разд.1"]["CV31"], f["стр.3_Разд.1"]["CY31"], f["стр.3_Разд.1"]["DB31"],
                   f["стр.3_Разд.1"]["DE31"], f["стр.3_Разд.1"]["DH31"])

        for _ in range(len(data["KKTandFN"]["FNName"][5])):
            FNname6[_].value = data["KKTandFN"]["FNName"][5][_]

        FNs = (f["стр.3_Разд.1"]["BC33"], f["стр.3_Разд.1"]["BF33"], f["стр.3_Разд.1"]["BI33"],
               f["стр.3_Разд.1"]["BL33"], f["стр.3_Разд.1"]["BO33"], f["стр.3_Разд.1"]["BR33"],
               f["стр.3_Разд.1"]["BU33"], f["стр.3_Разд.1"]["BX33"], f["стр.3_Разд.1"]["CA33"],
               f["стр.3_Разд.1"]["CD33"], f["стр.3_Разд.1"]["CG33"], f["стр.3_Разд.1"]["CJ33"],
               f["стр.3_Разд.1"]["CM33"], f["стр.3_Разд.1"]["CP33"], f["стр.3_Разд.1"]["CS33"],
               f["стр.3_Разд.1"]["CV33"], f["стр.3_Разд.1"]["CY33"], f["стр.3_Разд.1"]["DB33"],
               f["стр.3_Разд.1"]["DE33"], f["стр.3_Разд.1"]["DH33"])

        for _ in range(len(data["KKTandFN"]["SerialFN"])):
            FNs[_].value = data["KKTandFN"]["SerialFN"][_]

        index = (f["стр.3_Разд.1"]["AE38"], f["стр.3_Разд.1"]["AH38"], f["стр.3_Разд.1"]["AK38"],
                 f["стр.3_Разд.1"]["AN38"], f["стр.3_Разд.1"]["AQ38"], f["стр.3_Разд.1"]["AT38"])

        for _ in range(len(data["Address"]["index"])):
            index[_].value = data["Address"]["index"][_]

        f["стр.3_Разд.1"]["DK38"].value = data["Address"]["RegionCode"][0]
        f["стр.3_Разд.1"]["DN38"].value = data["Address"]["RegionCode"][1]

        distr = (f["стр.3_Разд.1"]["AE40"], f["стр.3_Разд.1"]["AH40"], f["стр.3_Разд.1"]["AK40"],
                 f["стр.3_Разд.1"]["AN40"], f["стр.3_Разд.1"]["AQ40"], f["стр.3_Разд.1"]["AT40"],
                 f["стр.3_Разд.1"]["AW40"], f["стр.3_Разд.1"]["AZ40"], f["стр.3_Разд.1"]["BC40"],
                 f["стр.3_Разд.1"]["BF40"], f["стр.3_Разд.1"]["BI40"], f["стр.3_Разд.1"]["BL40"],
                 f["стр.3_Разд.1"]["BO40"], f["стр.3_Разд.1"]["BR40"], f["стр.3_Разд.1"]["BU40"],
                 f["стр.3_Разд.1"]["BX40"], f["стр.3_Разд.1"]["CA40"], f["стр.3_Разд.1"]["CD40"],
                 f["стр.3_Разд.1"]["CG40"], f["стр.3_Разд.1"]["CJ40"], f["стр.3_Разд.1"]["CM40"],
                 f["стр.3_Разд.1"]["CP40"], f["стр.3_Разд.1"]["CS40"], f["стр.3_Разд.1"]["CV40"],
                 f["стр.3_Разд.1"]["CY40"], f["стр.3_Разд.1"]["DB40"], f["стр.3_Разд.1"]["DE40"],
                 f["стр.3_Разд.1"]["DH40"], f["стр.3_Разд.1"]["DK40"], f["стр.3_Разд.1"]["DN40"])

        for _ in range(len(data["Address"]["District"])):
            distr[_].value = data["Address"]["District"][_]

        city = (f["стр.3_Разд.1"]["AE42"], f["стр.3_Разд.1"]["AH42"], f["стр.3_Разд.1"]["AK42"],
                f["стр.3_Разд.1"]["AN42"], f["стр.3_Разд.1"]["AQ42"], f["стр.3_Разд.1"]["AT42"],
                f["стр.3_Разд.1"]["AW42"], f["стр.3_Разд.1"]["AZ42"], f["стр.3_Разд.1"]["BC42"],
                f["стр.3_Разд.1"]["BF42"], f["стр.3_Разд.1"]["BI42"], f["стр.3_Разд.1"]["BL42"],
                f["стр.3_Разд.1"]["BO42"], f["стр.3_Разд.1"]["BR42"], f["стр.3_Разд.1"]["BU42"],
                f["стр.3_Разд.1"]["BX42"], f["стр.3_Разд.1"]["CA42"], f["стр.3_Разд.1"]["CD42"],
                f["стр.3_Разд.1"]["CG42"], f["стр.3_Разд.1"]["CJ42"], f["стр.3_Разд.1"]["CM42"],
                f["стр.3_Разд.1"]["CP42"], f["стр.3_Разд.1"]["CS42"], f["стр.3_Разд.1"]["CV42"],
                f["стр.3_Разд.1"]["CY42"], f["стр.3_Разд.1"]["DB42"], f["стр.3_Разд.1"]["DE42"],
                f["стр.3_Разд.1"]["DH42"], f["стр.3_Разд.1"]["DK42"], f["стр.3_Разд.1"]["DN42"])

        for _ in range(len(data["Address"]["City"])):
            city[_].value = data["Address"]["City"][_]

        vill = (f["стр.3_Разд.1"]["AE44"], f["стр.3_Разд.1"]["AH44"], f["стр.3_Разд.1"]["AK44"],
                f["стр.3_Разд.1"]["AN44"], f["стр.3_Разд.1"]["AQ44"], f["стр.3_Разд.1"]["AT44"],
                f["стр.3_Разд.1"]["AW44"], f["стр.3_Разд.1"]["AZ44"], f["стр.3_Разд.1"]["BC44"],
                f["стр.3_Разд.1"]["BF44"], f["стр.3_Разд.1"]["BI44"], f["стр.3_Разд.1"]["BL44"],
                f["стр.3_Разд.1"]["BO44"], f["стр.3_Разд.1"]["BR44"], f["стр.3_Разд.1"]["BU44"],
                f["стр.3_Разд.1"]["BX44"], f["стр.3_Разд.1"]["CA44"], f["стр.3_Разд.1"]["CD44"],
                f["стр.3_Разд.1"]["CG44"], f["стр.3_Разд.1"]["CJ44"], f["стр.3_Разд.1"]["CM44"],
                f["стр.3_Разд.1"]["CP44"], f["стр.3_Разд.1"]["CS44"], f["стр.3_Разд.1"]["CV44"],
                f["стр.3_Разд.1"]["CY44"], f["стр.3_Разд.1"]["DB44"], f["стр.3_Разд.1"]["DE44"],
                f["стр.3_Разд.1"]["DH44"], f["стр.3_Разд.1"]["DK44"], f["стр.3_Разд.1"]["DN44"])

        for _ in range(len(data["Address"]["Village"])):
            vill[_].value = data["Address"]["Village"][_]

        street = (f["стр.4_Разд.1"]["AE9"], f["стр.4_Разд.1"]["AH9"], f["стр.4_Разд.1"]["AK9"],
                  f["стр.4_Разд.1"]["AN9"], f["стр.4_Разд.1"]["AQ9"], f["стр.4_Разд.1"]["AT9"],
                  f["стр.4_Разд.1"]["AW9"], f["стр.4_Разд.1"]["AZ9"], f["стр.4_Разд.1"]["BC9"],
                  f["стр.4_Разд.1"]["BF9"], f["стр.4_Разд.1"]["BI9"], f["стр.4_Разд.1"]["BL9"],
                  f["стр.4_Разд.1"]["BO9"], f["стр.4_Разд.1"]["BR9"], f["стр.4_Разд.1"]["BU9"],
                  f["стр.4_Разд.1"]["BX9"], f["стр.4_Разд.1"]["CA9"], f["стр.4_Разд.1"]["CD9"],
                  f["стр.4_Разд.1"]["CG9"], f["стр.4_Разд.1"]["CJ9"], f["стр.4_Разд.1"]["CM9"],
                  f["стр.4_Разд.1"]["CP9"], f["стр.4_Разд.1"]["CS9"], f["стр.4_Разд.1"]["CV9"],
                  f["стр.4_Разд.1"]["CY9"], f["стр.4_Разд.1"]["DB9"], f["стр.4_Разд.1"]["DE9"],
                  f["стр.4_Разд.1"]["DH9"], f["стр.4_Разд.1"]["DK9"], f["стр.4_Разд.1"]["DN9"])

        for _ in range(len(data["Address"]["Street"])):
            street[_].value = data["Address"]["Street"][_]

        house = (f["стр.4_Разд.1"]["AE11"], f["стр.4_Разд.1"]["AH11"], f["стр.4_Разд.1"]["AK11"],
                 f["стр.4_Разд.1"]["AN11"], f["стр.4_Разд.1"]["AQ11"], f["стр.4_Разд.1"]["AT11"],
                 f["стр.4_Разд.1"]["AW11"], f["стр.4_Разд.1"]["AZ11"])

        for _ in range(len(data["Address"]["House"])):
            house[_].value = data["Address"]["House"][_]

        camp = (f["стр.4_Разд.1"]["AE13"], f["стр.4_Разд.1"]["AH13"], f["стр.4_Разд.1"]["AK13"],
                f["стр.4_Разд.1"]["AN13"], f["стр.4_Разд.1"]["AQ13"], f["стр.4_Разд.1"]["AT13"],
                f["стр.4_Разд.1"]["AW13"], f["стр.4_Разд.1"]["AZ13"])

        for _ in range(len(data["Address"]["Campus"])):
            camp[_].value = data["Address"]["Campus"][_]

        room = (f["стр.4_Разд.1"]["AE15"], f["стр.4_Разд.1"]["AH15"], f["стр.4_Разд.1"]["AK15"],
                f["стр.4_Разд.1"]["AN15"], f["стр.4_Разд.1"]["AQ15"], f["стр.4_Разд.1"]["AT15"],
                f["стр.4_Разд.1"]["AW15"], f["стр.4_Разд.1"]["AZ15"])

        for _ in range(len(data["Address"]["Room"])):
            room[_].value = data["Address"]["Room"][_]

        place1 = (f["стр.4_Разд.1"]["AZ18"], f["стр.4_Разд.1"]["BC18"], f["стр.4_Разд.1"]["BF18"],
                  f["стр.4_Разд.1"]["BI18"], f["стр.4_Разд.1"]["BL18"], f["стр.4_Разд.1"]["BO18"],
                  f["стр.4_Разд.1"]["BR18"], f["стр.4_Разд.1"]["BU18"], f["стр.4_Разд.1"]["BX18"],
                  f["стр.4_Разд.1"]["CA18"], f["стр.4_Разд.1"]["CD18"], f["стр.4_Разд.1"]["CG18"],
                  f["стр.4_Разд.1"]["CJ18"], f["стр.4_Разд.1"]["CM18"], f["стр.4_Разд.1"]["CP18"],
                  f["стр.4_Разд.1"]["CS18"], f["стр.4_Разд.1"]["CV18"], f["стр.4_Разд.1"]["CY18"],
                  f["стр.4_Разд.1"]["DB18"], f["стр.4_Разд.1"]["DE18"])

        for _ in range(len(data["Address"]["Place"][0])):
            place1[_].value = data["Address"]["Place"][0][_]

        place2 = (f["стр.4_Разд.1"]["AZ20"], f["стр.4_Разд.1"]["BC20"], f["стр.4_Разд.1"]["BF20"],
                  f["стр.4_Разд.1"]["BI20"], f["стр.4_Разд.1"]["BL20"], f["стр.4_Разд.1"]["BO20"],
                  f["стр.4_Разд.1"]["BR20"], f["стр.4_Разд.1"]["BU20"], f["стр.4_Разд.1"]["BX20"],
                  f["стр.4_Разд.1"]["CA20"], f["стр.4_Разд.1"]["CD20"], f["стр.4_Разд.1"]["CG20"],
                  f["стр.4_Разд.1"]["CJ20"], f["стр.4_Разд.1"]["CM20"], f["стр.4_Разд.1"]["CP20"],
                  f["стр.4_Разд.1"]["CS20"], f["стр.4_Разд.1"]["CV20"], f["стр.4_Разд.1"]["CY20"],
                  f["стр.4_Разд.1"]["DB20"], f["стр.4_Разд.1"]["DE20"])

        for _ in range(len(data["Address"]["Place"][1])):
            place2[_].value = data["Address"]["Place"][1][_]

        place3 = (f["стр.4_Разд.1"]["AZ22"], f["стр.4_Разд.1"]["BC22"], f["стр.4_Разд.1"]["BF22"],
                  f["стр.4_Разд.1"]["BI22"], f["стр.4_Разд.1"]["BL22"], f["стр.4_Разд.1"]["BO22"],
                  f["стр.4_Разд.1"]["BR22"], f["стр.4_Разд.1"]["BU22"], f["стр.4_Разд.1"]["BX22"],
                  f["стр.4_Разд.1"]["CA22"], f["стр.4_Разд.1"]["CD22"], f["стр.4_Разд.1"]["CG22"],
                  f["стр.4_Разд.1"]["CJ22"], f["стр.4_Разд.1"]["CM22"], f["стр.4_Разд.1"]["CP22"],
                  f["стр.4_Разд.1"]["CS22"], f["стр.4_Разд.1"]["CV22"], f["стр.4_Разд.1"]["CY22"],
                  f["стр.4_Разд.1"]["DB22"], f["стр.4_Разд.1"]["DE22"])

        for _ in range(len(data["Address"]["Place"][2])):
            place3[_].value = data["Address"]["Place"][2][_]

        Using = (f["стр.4_Разд.1"]["AZ27"], f["стр.5_Разд.2"]["BF11"], f["стр.5_Разд.2"]["BF18"],
                 f["стр.5_Разд.2"]["BF23"], f["стр.5_Разд.2"]["BF29"], f["стр.5_Разд.2"]["BF33"],
                 f["стр.5_Разд.2"]["BF37"], f["стр.5_Разд.2"]["BF42"], f["стр.6_Разд.2"]["BF10"],
                 f["стр.6_Разд.2"]["BF15"], f["стр.6_Разд.2"]["BF19"], f["стр.6_Разд.2"]["BF24"])

        for _ in range(len(data["OFD"]["Using"])):
            Using[_].value = "1" if data["OFD"]["Using"][_] else "2"

        OFDName1 = (f["стр.9_Разд.3"]["BC12"], f["стр.9_Разд.3"]["BF12"], f["стр.9_Разд.3"]["BI12"],
                    f["стр.9_Разд.3"]["BL12"], f["стр.9_Разд.3"]["BO12"], f["стр.9_Разд.3"]["BR12"],
                    f["стр.9_Разд.3"]["BU12"], f["стр.9_Разд.3"]["BX12"], f["стр.9_Разд.3"]["CA12"],
                    f["стр.9_Разд.3"]["CD12"], f["стр.9_Разд.3"]["CG12"], f["стр.9_Разд.3"]["CJ12"],
                    f["стр.9_Разд.3"]["CM12"], f["стр.9_Разд.3"]["CP12"], f["стр.9_Разд.3"]["CS12"],
                    f["стр.9_Разд.3"]["CV12"], f["стр.9_Разд.3"]["CY12"], f["стр.9_Разд.3"]["DB12"],
                    f["стр.9_Разд.3"]["DE12"], f["стр.9_Разд.3"]["DH12"])

        for _ in range(len(data["OFD"]["OFDName"][0])):
            OFDName1[_].value = data["OFD"]["OFDName"][0][_]

        OFDName2 = (f["стр.9_Разд.3"]["BC14"], f["стр.9_Разд.3"]["BF14"], f["стр.9_Разд.3"]["BI14"],
                    f["стр.9_Разд.3"]["BL14"], f["стр.9_Разд.3"]["BO14"], f["стр.9_Разд.3"]["BR14"],
                    f["стр.9_Разд.3"]["BU14"], f["стр.9_Разд.3"]["BX14"], f["стр.9_Разд.3"]["CA14"],
                    f["стр.9_Разд.3"]["CD14"], f["стр.9_Разд.3"]["CG14"], f["стр.9_Разд.3"]["CJ14"],
                    f["стр.9_Разд.3"]["CM14"], f["стр.9_Разд.3"]["CP14"], f["стр.9_Разд.3"]["CS14"],
                    f["стр.9_Разд.3"]["CV14"], f["стр.9_Разд.3"]["CY14"], f["стр.9_Разд.3"]["DB14"],
                    f["стр.9_Разд.3"]["DE14"], f["стр.9_Разд.3"]["DH14"])

        for _ in range(len(data["OFD"]["OFDName"][1])):
            OFDName2[_].value = data["OFD"]["OFDName"][1][_]

        OFDName3 = (f["стр.9_Разд.3"]["BC16"], f["стр.9_Разд.3"]["BF16"], f["стр.9_Разд.3"]["BI16"],
                    f["стр.9_Разд.3"]["BL16"], f["стр.9_Разд.3"]["BO16"], f["стр.9_Разд.3"]["BR16"],
                    f["стр.9_Разд.3"]["BU16"], f["стр.9_Разд.3"]["BX16"], f["стр.9_Разд.3"]["CA16"],
                    f["стр.9_Разд.3"]["CD16"], f["стр.9_Разд.3"]["CG16"], f["стр.9_Разд.3"]["CJ16"],
                    f["стр.9_Разд.3"]["CM16"], f["стр.9_Разд.3"]["CP16"], f["стр.9_Разд.3"]["CS16"],
                    f["стр.9_Разд.3"]["CV16"], f["стр.9_Разд.3"]["CY16"], f["стр.9_Разд.3"]["DB16"],
                    f["стр.9_Разд.3"]["DE16"], f["стр.9_Разд.3"]["DH16"])

        for _ in range(len(data["OFD"]["OFDName"][2])):
            OFDName3[_].value = data["OFD"]["OFDName"][2][_]

        OFDName4 = (f["стр.9_Разд.3"]["BC18"], f["стр.9_Разд.3"]["BF18"], f["стр.9_Разд.3"]["BI18"],
                    f["стр.9_Разд.3"]["BL18"], f["стр.9_Разд.3"]["BO18"], f["стр.9_Разд.3"]["BR18"],
                    f["стр.9_Разд.3"]["BU18"], f["стр.9_Разд.3"]["BX18"], f["стр.9_Разд.3"]["CA18"],
                    f["стр.9_Разд.3"]["CD18"], f["стр.9_Разд.3"]["CG18"], f["стр.9_Разд.3"]["CJ18"],
                    f["стр.9_Разд.3"]["CM18"], f["стр.9_Разд.3"]["CP18"], f["стр.9_Разд.3"]["CS18"],
                    f["стр.9_Разд.3"]["CV18"], f["стр.9_Разд.3"]["CY18"], f["стр.9_Разд.3"]["DB18"],
                    f["стр.9_Разд.3"]["DE18"], f["стр.9_Разд.3"]["DH18"])

        for _ in range(len(data["OFD"]["OFDName"][3])):
            OFDName4[_].value = data["OFD"]["OFDName"][3][_]

        OFDInn = (f["стр.9_Разд.3"]["BC21"], f["стр.9_Разд.3"]["BF21"], f["стр.9_Разд.3"]["BI21"],
                  f["стр.9_Разд.3"]["BL21"], f["стр.9_Разд.3"]["BO21"], f["стр.9_Разд.3"]["BR21"],
                  f["стр.9_Разд.3"]["BU21"], f["стр.9_Разд.3"]["BX21"], f["стр.9_Разд.3"]["CA21"],
                  f["стр.9_Разд.3"]["CD21"], f["стр.9_Разд.3"]["CG21"], f["стр.9_Разд.3"]["CJ21"])

        for _ in range(len(data["OFD"]["OFDInn"])):
            OFDInn[_].value = data["OFD"]["OFDInn"][_]

        f["стр.10_Разд.4"]["BD11"].value = "1" if data["Raports"]["FNBroken"] else "2"

        if not data["Raports"]["RegRep"]["OnRegRep"]:
            Nreg = (f["стр.10_Разд.4"]["BD18"], f["стр.10_Разд.4"]["BG18"], f["стр.10_Разд.4"]["BJ18"],
                    f["стр.10_Разд.4"]["BM18"], f["стр.10_Разд.4"]["BP18"], f["стр.10_Разд.4"]["BS18"],
                    f["стр.10_Разд.4"]["BV18"], f["стр.10_Разд.4"]["BY18"])

            for _ in range(len(data["Raports"]["RegRep"]["Nrep"])):
                Nreg[_].value = data["Raports"]["RegRep"]["Nrep"][_]

            DateReg = (f["стр.10_Разд.4"]["BD22"], f["стр.10_Разд.4"]["BG22"], f["стр.10_Разд.4"]["BM22"],
                       f["стр.10_Разд.4"]["BP22"], f["стр.10_Разд.4"]["BV22"], f["стр.10_Разд.4"]["BY22"],
                       f["стр.10_Разд.4"]["CB22"], f["стр.10_Разд.4"]["CE22"])

            Date = FormatDate(data["Raports"]["RegRep"]["Date"])

            for _ in range(len(Date)):
                DateReg[_].value = Date[_]

            TimeReg = (f["стр.10_Разд.4"]["BD26"], f["стр.10_Разд.4"]["BG26"],
                       f["стр.10_Разд.4"]["BM26"], f["стр.10_Разд.4"]["BP26"])

            Time = "".join(data["Raports"]["RegRep"]["Time"].split(":"))

            for _ in range(len(Time)):
                TimeReg[_].value = Time[_]

            FPreg = (f["стр.10_Разд.4"]["BD29"], f["стр.10_Разд.4"]["BG29"], f["стр.10_Разд.4"]["BJ29"],
                     f["стр.10_Разд.4"]["BM29"], f["стр.10_Разд.4"]["BP29"], f["стр.10_Разд.4"]["BS29"],
                     f["стр.10_Разд.4"]["BV29"], f["стр.10_Разд.4"]["BY29"], f["стр.10_Разд.4"]["CB29"],
                     f["стр.10_Разд.4"]["CE29"])

            for _ in range(len(data["Raports"]["RegRep"]["FP"])):
                FPreg[_].value = data["Raports"]["RegRep"]["FP"][_]
    else:
        f["стр.3_Разд.1"]["BD11"].value = "1" if data["Raports"]["FNBroken"] or True in data["DeReg"] else "2"

    if not data["Raports"]["ClosReg"]["OnRegClose"]:
        if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
            Nclos = (f["стр.10_Разд.4"]["BD34"], f["стр.10_Разд.4"]["BG34"], f["стр.10_Разд.4"]["BJ34"],
                     f["стр.10_Разд.4"]["BM34"], f["стр.10_Разд.4"]["BP34"], f["стр.10_Разд.4"]["BS34"],
                     f["стр.10_Разд.4"]["BV34"], f["стр.10_Разд.4"]["BY34"])
        else:
            Nclos = (f["стр.3_Разд.1"]["BD17"], f["стр.3_Разд.1"]["BG17"], f["стр.3_Разд.1"]["BJ17"],
                     f["стр.3_Разд.1"]["BM17"], f["стр.3_Разд.1"]["BP17"], f["стр.3_Разд.1"]["BS17"],
                     f["стр.3_Разд.1"]["BV17"], f["стр.3_Разд.1"]["BY17"])

        for _ in range(len(data["Raports"]["ClosReg"]["Nrep"])):
            Nclos[_].value = data["Raports"]["ClosReg"]["Nrep"][_]

        if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
            DateReg = (f["стр.10_Разд.4"]["BD38"], f["стр.10_Разд.4"]["BG38"], f["стр.10_Разд.4"]["BM38"],
                       f["стр.10_Разд.4"]["BP38"], f["стр.10_Разд.4"]["BV38"], f["стр.10_Разд.4"]["BY38"],
                       f["стр.10_Разд.4"]["CB38"], f["стр.10_Разд.4"]["CE38"])
        else:
            DateReg = (f["стр.3_Разд.1"]["BD21"], f["стр.3_Разд.1"]["BG21"], f["стр.3_Разд.1"]["BM21"],
                       f["стр.3_Разд.1"]["BP21"], f["стр.3_Разд.1"]["BV21"], f["стр.3_Разд.1"]["BY21"],
                       f["стр.3_Разд.1"]["CB21"], f["стр.3_Разд.1"]["CE21"])

        Date = FormatDate(data["Raports"]["ClosReg"]["Date"])

        for _ in range(len(Date)):
            DateReg[_].value = Date[_]

        if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
            TimeReg = (f["стр.10_Разд.4"]["BD42"], f["стр.10_Разд.4"]["BG42"],
                       f["стр.10_Разд.4"]["BM42"], f["стр.10_Разд.4"]["BP42"])
        else:
            TimeReg = (f["стр.3_Разд.1"]["BD25"], f["стр.3_Разд.1"]["BG25"],
                       f["стр.3_Разд.1"]["BM25"], f["стр.3_Разд.1"]["BP25"])

        Time = "".join(data["Raports"]["ClosReg"]["Time"].split(":"))

        for _ in range(len(Time)):
            TimeReg[_].value = Time[_]

        if data["Primary"]["TypeDock"] in ("Регистрация", "Перерегистрация"):
            FPreg = (f["стр.10_Разд.4"]["BD45"], f["стр.10_Разд.4"]["BG45"], f["стр.10_Разд.4"]["BJ45"],
                     f["стр.10_Разд.4"]["BM45"], f["стр.10_Разд.4"]["BP45"], f["стр.10_Разд.4"]["BS45"],
                     f["стр.10_Разд.4"]["BV45"], f["стр.10_Разд.4"]["BY45"], f["стр.10_Разд.4"]["CB45"],
                     f["стр.10_Разд.4"]["CE45"])
        else:
            FPreg = (f["стр.3_Разд.1"]["BD28"], f["стр.3_Разд.1"]["BG28"], f["стр.3_Разд.1"]["BJ28"],
                     f["стр.3_Разд.1"]["BM28"], f["стр.3_Разд.1"]["BP28"], f["стр.3_Разд.1"]["BS28"],
                     f["стр.3_Разд.1"]["BV28"], f["стр.3_Разд.1"]["BY28"], f["стр.3_Разд.1"]["CB28"],
                     f["стр.3_Разд.1"]["CE28"])

        for _ in range(len(data["Raports"]["ClosReg"]["FP"])):
            FPreg[_].value = data["Raports"]["ClosReg"]["FP"][_]

    if data["Primary"]["TypeDock"] == "Снятие с учета":
        f["стр.1"]["BC26"].value = "1" if data["DeReg"][0] else "2"
        f["стр.1"]["BC29"].value = "1" if data["DeReg"][1] else "2"

    if data["OFD"]["Using"][6]:
        d1index = (f["стр.7_Разд.2.1"]["AE19"], f["стр.7_Разд.2.1"]["AH19"], f["стр.7_Разд.2.1"]["AK19"],
                   f["стр.7_Разд.2.1"]["AN19"], f["стр.7_Разд.2.1"]["AQ19"], f["стр.7_Разд.2.1"]["AT19"])

        d2index = (f["стр.8_Разд.2.1"]["AE23"], f["стр.8_Разд.2.1"]["AH23"], f["стр.8_Разд.2.1"]["AK23"],
                   f["стр.8_Разд.2.1"]["AN23"], f["стр.8_Разд.2.1"]["AQ23"], f["стр.8_Разд.2.1"]["AT23"])

        for _ in range(len(data["AutoCalcDevice"]["device1"]["index"])):
            d1index[_].value = data["AutoCalcDevice"]["device1"]["index"][_]
            d2index[_].value = data["AutoCalcDevice"]["device2"]["index"][_]

        f["стр.7_Разд.2.1"]["DK19"].value, f["стр.7_Разд.2.1"]["DN19"].value = \
            data["AutoCalcDevice"]["device1"]["regioncode"][0], data["AutoCalcDevice"]["device1"]["regioncode"][1]

        f["стр.8_Разд.2.1"]["DK23"].value, f["стр.8_Разд.2.1"]["DN23"].value = \
            data["AutoCalcDevice"]["device2"]["regioncode"][0], data["AutoCalcDevice"]["device2"]["regioncode"][1]

        n1 = (f["стр.7_Разд.2.1"]["BA11"], f["стр.7_Разд.2.1"]["BD11"], f["стр.7_Разд.2.1"]["BG11"],
              f["стр.7_Разд.2.1"]["BJ11"], f["стр.7_Разд.2.1"]["BM11"], f["стр.7_Разд.2.1"]["BP11"],
              f["стр.7_Разд.2.1"]["BS11"], f["стр.7_Разд.2.1"]["BV11"], f["стр.7_Разд.2.1"]["BY11"],
              f["стр.7_Разд.2.1"]["CB11"], f["стр.7_Разд.2.1"]["CE11"], f["стр.7_Разд.2.1"]["CH11"],
              f["стр.7_Разд.2.1"]["CK11"], f["стр.7_Разд.2.1"]["CN11"], f["стр.7_Разд.2.1"]["CQ11"],
              f["стр.7_Разд.2.1"]["CT11"], f["стр.7_Разд.2.1"]["CW11"], f["стр.7_Разд.2.1"]["CZ11"],
              f["стр.7_Разд.2.1"]["DC11"], f["стр.7_Разд.2.1"]["DF11"])

        n2 = (f["стр.8_Разд.2.1"]["BA16"], f["стр.8_Разд.2.1"]["BD16"], f["стр.8_Разд.2.1"]["BG16"],
              f["стр.8_Разд.2.1"]["BJ16"], f["стр.8_Разд.2.1"]["BM16"], f["стр.8_Разд.2.1"]["BP16"],
              f["стр.8_Разд.2.1"]["BS16"], f["стр.8_Разд.2.1"]["BV16"], f["стр.8_Разд.2.1"]["BY16"],
              f["стр.8_Разд.2.1"]["CB16"], f["стр.8_Разд.2.1"]["CE16"], f["стр.8_Разд.2.1"]["CH16"],
              f["стр.8_Разд.2.1"]["CK16"], f["стр.8_Разд.2.1"]["CN16"], f["стр.8_Разд.2.1"]["CQ16"],
              f["стр.8_Разд.2.1"]["CT16"], f["стр.8_Разд.2.1"]["CW16"], f["стр.8_Разд.2.1"]["CZ16"],
              f["стр.8_Разд.2.1"]["DC16"], f["стр.8_Разд.2.1"]["DF16"])

        for _ in range(len(data["AutoCalcDevice"]["device1"]["number"])):
            n1[_].value = data["AutoCalcDevice"]["device1"]["number"][_]
            n2[_].value = data["AutoCalcDevice"]["device2"]["number"][_]

        d1distr = (f["стр.7_Разд.2.1"]["AE21"], f["стр.7_Разд.2.1"]["AH21"], f["стр.7_Разд.2.1"]["AK21"],
                   f["стр.7_Разд.2.1"]["AN21"], f["стр.7_Разд.2.1"]["AQ21"], f["стр.7_Разд.2.1"]["AT21"],
                   f["стр.7_Разд.2.1"]["AW21"], f["стр.7_Разд.2.1"]["AZ21"], f["стр.7_Разд.2.1"]["BC21"],
                   f["стр.7_Разд.2.1"]["BF21"], f["стр.7_Разд.2.1"]["BI21"], f["стр.7_Разд.2.1"]["BL21"],
                   f["стр.7_Разд.2.1"]["BO21"], f["стр.7_Разд.2.1"]["BR21"], f["стр.7_Разд.2.1"]["BU21"],
                   f["стр.7_Разд.2.1"]["BX21"], f["стр.7_Разд.2.1"]["CA21"], f["стр.7_Разд.2.1"]["CD21"],
                   f["стр.7_Разд.2.1"]["CG21"], f["стр.7_Разд.2.1"]["CJ21"], f["стр.7_Разд.2.1"]["CM21"],
                   f["стр.7_Разд.2.1"]["CP21"], f["стр.7_Разд.2.1"]["CS21"], f["стр.7_Разд.2.1"]["CV21"],
                   f["стр.7_Разд.2.1"]["CY21"], f["стр.7_Разд.2.1"]["DB21"], f["стр.7_Разд.2.1"]["DE21"],
                   f["стр.7_Разд.2.1"]["DH21"], f["стр.7_Разд.2.1"]["DK21"], f["стр.7_Разд.2.1"]["DN21"])

        d2distr = (f["стр.8_Разд.2.1"]["AE25"], f["стр.8_Разд.2.1"]["AH25"], f["стр.8_Разд.2.1"]["AK25"],
                   f["стр.8_Разд.2.1"]["AN25"], f["стр.8_Разд.2.1"]["AQ25"], f["стр.8_Разд.2.1"]["AT25"],
                   f["стр.8_Разд.2.1"]["AW25"], f["стр.8_Разд.2.1"]["AZ25"], f["стр.8_Разд.2.1"]["BC25"],
                   f["стр.8_Разд.2.1"]["BF25"], f["стр.8_Разд.2.1"]["BI25"], f["стр.8_Разд.2.1"]["BL25"],
                   f["стр.8_Разд.2.1"]["BO25"], f["стр.8_Разд.2.1"]["BR25"], f["стр.8_Разд.2.1"]["BU25"],
                   f["стр.8_Разд.2.1"]["BX25"], f["стр.8_Разд.2.1"]["CA25"], f["стр.8_Разд.2.1"]["CD25"],
                   f["стр.8_Разд.2.1"]["CG25"], f["стр.8_Разд.2.1"]["CJ25"], f["стр.8_Разд.2.1"]["CM25"],
                   f["стр.8_Разд.2.1"]["CP25"], f["стр.8_Разд.2.1"]["CS25"], f["стр.8_Разд.2.1"]["CV25"],
                   f["стр.8_Разд.2.1"]["CY25"], f["стр.8_Разд.2.1"]["DB25"], f["стр.8_Разд.2.1"]["DE25"],
                   f["стр.8_Разд.2.1"]["DH25"], f["стр.8_Разд.2.1"]["DK25"], f["стр.8_Разд.2.1"]["DN25"])

        d1city = (f["стр.7_Разд.2.1"]["AE23"], f["стр.7_Разд.2.1"]["AH23"], f["стр.7_Разд.2.1"]["AK23"],
                  f["стр.7_Разд.2.1"]["AN23"], f["стр.7_Разд.2.1"]["AQ23"], f["стр.7_Разд.2.1"]["AT23"],
                  f["стр.7_Разд.2.1"]["AW23"], f["стр.7_Разд.2.1"]["AZ23"], f["стр.7_Разд.2.1"]["BC23"],
                  f["стр.7_Разд.2.1"]["BF23"], f["стр.7_Разд.2.1"]["BI23"], f["стр.7_Разд.2.1"]["BL23"],
                  f["стр.7_Разд.2.1"]["BO23"], f["стр.7_Разд.2.1"]["BR23"], f["стр.7_Разд.2.1"]["BU23"],
                  f["стр.7_Разд.2.1"]["BX23"], f["стр.7_Разд.2.1"]["CA23"], f["стр.7_Разд.2.1"]["CD23"],
                  f["стр.7_Разд.2.1"]["CG23"], f["стр.7_Разд.2.1"]["CJ23"], f["стр.7_Разд.2.1"]["CM23"],
                  f["стр.7_Разд.2.1"]["CP23"], f["стр.7_Разд.2.1"]["CS23"], f["стр.7_Разд.2.1"]["CV23"],
                  f["стр.7_Разд.2.1"]["CY23"], f["стр.7_Разд.2.1"]["DB23"], f["стр.7_Разд.2.1"]["DE23"],
                  f["стр.7_Разд.2.1"]["DH23"], f["стр.7_Разд.2.1"]["DK23"], f["стр.7_Разд.2.1"]["DN23"])

        d2city = (f["стр.8_Разд.2.1"]["AE27"], f["стр.8_Разд.2.1"]["AH27"], f["стр.8_Разд.2.1"]["AK27"],
                  f["стр.8_Разд.2.1"]["AN27"], f["стр.8_Разд.2.1"]["AQ27"], f["стр.8_Разд.2.1"]["AT27"],
                  f["стр.8_Разд.2.1"]["AW27"], f["стр.8_Разд.2.1"]["AZ27"], f["стр.8_Разд.2.1"]["BC27"],
                  f["стр.8_Разд.2.1"]["BF27"], f["стр.8_Разд.2.1"]["BI27"], f["стр.8_Разд.2.1"]["BL27"],
                  f["стр.8_Разд.2.1"]["BO27"], f["стр.8_Разд.2.1"]["BR27"], f["стр.8_Разд.2.1"]["BU27"],
                  f["стр.8_Разд.2.1"]["BX27"], f["стр.8_Разд.2.1"]["CA27"], f["стр.8_Разд.2.1"]["CD27"],
                  f["стр.8_Разд.2.1"]["CG27"], f["стр.8_Разд.2.1"]["CJ27"], f["стр.8_Разд.2.1"]["CM27"],
                  f["стр.8_Разд.2.1"]["CP27"], f["стр.8_Разд.2.1"]["CS27"], f["стр.8_Разд.2.1"]["CV27"],
                  f["стр.8_Разд.2.1"]["CY27"], f["стр.8_Разд.2.1"]["DB27"], f["стр.8_Разд.2.1"]["DE27"],
                  f["стр.8_Разд.2.1"]["DH27"], f["стр.8_Разд.2.1"]["DK27"], f["стр.8_Разд.2.1"]["DN27"])

        d1village = (f["стр.7_Разд.2.1"]["AE25"], f["стр.7_Разд.2.1"]["AH25"], f["стр.7_Разд.2.1"]["AK25"],
                     f["стр.7_Разд.2.1"]["AN25"], f["стр.7_Разд.2.1"]["AQ25"], f["стр.7_Разд.2.1"]["AT25"],
                     f["стр.7_Разд.2.1"]["AW25"], f["стр.7_Разд.2.1"]["AZ25"], f["стр.7_Разд.2.1"]["BC25"],
                     f["стр.7_Разд.2.1"]["BF25"], f["стр.7_Разд.2.1"]["BI25"], f["стр.7_Разд.2.1"]["BL25"],
                     f["стр.7_Разд.2.1"]["BO25"], f["стр.7_Разд.2.1"]["BR25"], f["стр.7_Разд.2.1"]["BU25"],
                     f["стр.7_Разд.2.1"]["BX25"], f["стр.7_Разд.2.1"]["CA25"], f["стр.7_Разд.2.1"]["CD25"],
                     f["стр.7_Разд.2.1"]["CG25"], f["стр.7_Разд.2.1"]["CJ25"], f["стр.7_Разд.2.1"]["CM25"],
                     f["стр.7_Разд.2.1"]["CP25"], f["стр.7_Разд.2.1"]["CS25"], f["стр.7_Разд.2.1"]["CV25"],
                     f["стр.7_Разд.2.1"]["CY25"], f["стр.7_Разд.2.1"]["DB25"], f["стр.7_Разд.2.1"]["DE25"],
                     f["стр.7_Разд.2.1"]["DH25"], f["стр.7_Разд.2.1"]["DK25"], f["стр.7_Разд.2.1"]["DN25"])

        d2village = (f["стр.8_Разд.2.1"]["AE29"], f["стр.8_Разд.2.1"]["AH29"], f["стр.8_Разд.2.1"]["AK29"],
                     f["стр.8_Разд.2.1"]["AN29"], f["стр.8_Разд.2.1"]["AQ29"], f["стр.8_Разд.2.1"]["AT29"],
                     f["стр.8_Разд.2.1"]["AW29"], f["стр.8_Разд.2.1"]["AZ29"], f["стр.8_Разд.2.1"]["BC29"],
                     f["стр.8_Разд.2.1"]["BF29"], f["стр.8_Разд.2.1"]["BI29"], f["стр.8_Разд.2.1"]["BL29"],
                     f["стр.8_Разд.2.1"]["BO29"], f["стр.8_Разд.2.1"]["BR29"], f["стр.8_Разд.2.1"]["BU29"],
                     f["стр.8_Разд.2.1"]["BX29"], f["стр.8_Разд.2.1"]["CA29"], f["стр.8_Разд.2.1"]["CD29"],
                     f["стр.8_Разд.2.1"]["CG29"], f["стр.8_Разд.2.1"]["CJ29"], f["стр.8_Разд.2.1"]["CM29"],
                     f["стр.8_Разд.2.1"]["CP29"], f["стр.8_Разд.2.1"]["CS29"], f["стр.8_Разд.2.1"]["CV29"],
                     f["стр.8_Разд.2.1"]["CY29"], f["стр.8_Разд.2.1"]["DB29"], f["стр.8_Разд.2.1"]["DE29"],
                     f["стр.8_Разд.2.1"]["DH29"], f["стр.8_Разд.2.1"]["DK29"], f["стр.8_Разд.2.1"]["DN29"])

        d1street = (f["стр.7_Разд.2.1"]["AE27"], f["стр.7_Разд.2.1"]["AH27"], f["стр.7_Разд.2.1"]["AK27"],
                    f["стр.7_Разд.2.1"]["AN27"], f["стр.7_Разд.2.1"]["AQ27"], f["стр.7_Разд.2.1"]["AT27"],
                    f["стр.7_Разд.2.1"]["AW27"], f["стр.7_Разд.2.1"]["AZ27"], f["стр.7_Разд.2.1"]["BC27"],
                    f["стр.7_Разд.2.1"]["BF27"], f["стр.7_Разд.2.1"]["BI27"], f["стр.7_Разд.2.1"]["BL27"],
                    f["стр.7_Разд.2.1"]["BO27"], f["стр.7_Разд.2.1"]["BR27"], f["стр.7_Разд.2.1"]["BU27"],
                    f["стр.7_Разд.2.1"]["BX27"], f["стр.7_Разд.2.1"]["CA27"], f["стр.7_Разд.2.1"]["CD27"],
                    f["стр.7_Разд.2.1"]["CG27"], f["стр.7_Разд.2.1"]["CJ27"], f["стр.7_Разд.2.1"]["CM27"],
                    f["стр.7_Разд.2.1"]["CP27"], f["стр.7_Разд.2.1"]["CS27"], f["стр.7_Разд.2.1"]["CV27"],
                    f["стр.7_Разд.2.1"]["CY27"], f["стр.7_Разд.2.1"]["DB27"], f["стр.7_Разд.2.1"]["DE27"],
                    f["стр.7_Разд.2.1"]["DH27"], f["стр.7_Разд.2.1"]["DK27"], f["стр.7_Разд.2.1"]["DN27"])

        d2street = (f["стр.8_Разд.2.1"]["AE31"], f["стр.8_Разд.2.1"]["AH31"], f["стр.8_Разд.2.1"]["AK31"],
                    f["стр.8_Разд.2.1"]["AN31"], f["стр.8_Разд.2.1"]["AQ31"], f["стр.8_Разд.2.1"]["AT31"],
                    f["стр.8_Разд.2.1"]["AW31"], f["стр.8_Разд.2.1"]["AZ31"], f["стр.8_Разд.2.1"]["BC31"],
                    f["стр.8_Разд.2.1"]["BF31"], f["стр.8_Разд.2.1"]["BI31"], f["стр.8_Разд.2.1"]["BL31"],
                    f["стр.8_Разд.2.1"]["BO31"], f["стр.8_Разд.2.1"]["BR31"], f["стр.8_Разд.2.1"]["BU31"],
                    f["стр.8_Разд.2.1"]["BX31"], f["стр.8_Разд.2.1"]["CA31"], f["стр.8_Разд.2.1"]["CD31"],
                    f["стр.8_Разд.2.1"]["CG31"], f["стр.8_Разд.2.1"]["CJ31"], f["стр.8_Разд.2.1"]["CM31"],
                    f["стр.8_Разд.2.1"]["CP31"], f["стр.8_Разд.2.1"]["CS31"], f["стр.8_Разд.2.1"]["CV31"],
                    f["стр.8_Разд.2.1"]["CY31"], f["стр.8_Разд.2.1"]["DB31"], f["стр.8_Разд.2.1"]["DE31"],
                    f["стр.8_Разд.2.1"]["DH31"], f["стр.8_Разд.2.1"]["DK31"], f["стр.8_Разд.2.1"]["DN31"])

        for _ in range(len(data["AutoCalcDevice"]["device1"]["street"])):
            d1distr[_].value = data["AutoCalcDevice"]["device1"]["district"][_]
            d1city[_].value = data["AutoCalcDevice"]["device1"]["city"][_]
            d1village[_].value = data["AutoCalcDevice"]["device1"]["village"][_]
            d1street[_].value = data["AutoCalcDevice"]["device1"]["street"][_]

            d2distr[_].value = data["AutoCalcDevice"]["device2"]["district"][_]
            d2city[_].value = data["AutoCalcDevice"]["device2"]["city"][_]
            d2village[_].value = data["AutoCalcDevice"]["device2"]["village"][_]
            d2street[_].value = data["AutoCalcDevice"]["device2"]["street"][_]

        d1house = (f["стр.7_Разд.2.1"]["AE29"], f["стр.7_Разд.2.1"]["AH29"], f["стр.7_Разд.2.1"]["AK29"],
                   f["стр.7_Разд.2.1"]["AN29"], f["стр.7_Разд.2.1"]["AQ29"], f["стр.7_Разд.2.1"]["AT29"],
                   f["стр.7_Разд.2.1"]["AW29"], f["стр.7_Разд.2.1"]["AZ29"])

        d2house = (f["стр.8_Разд.2.1"]["AE33"], f["стр.8_Разд.2.1"]["AH33"], f["стр.8_Разд.2.1"]["AK33"],
                   f["стр.8_Разд.2.1"]["AN33"], f["стр.8_Разд.2.1"]["AQ33"], f["стр.8_Разд.2.1"]["AT33"],
                   f["стр.8_Разд.2.1"]["AW33"], f["стр.8_Разд.2.1"]["AZ33"])

        d1camp = (f["стр.7_Разд.2.1"]["AE31"], f["стр.7_Разд.2.1"]["AH31"], f["стр.7_Разд.2.1"]["AK31"],
                  f["стр.7_Разд.2.1"]["AN31"], f["стр.7_Разд.2.1"]["AQ31"], f["стр.7_Разд.2.1"]["AT31"],
                  f["стр.7_Разд.2.1"]["AW31"], f["стр.7_Разд.2.1"]["AZ31"])

        d2camp = (f["стр.8_Разд.2.1"]["AE35"], f["стр.8_Разд.2.1"]["AH35"], f["стр.8_Разд.2.1"]["AK35"],
                  f["стр.8_Разд.2.1"]["AN35"], f["стр.8_Разд.2.1"]["AQ35"], f["стр.8_Разд.2.1"]["AT35"],
                  f["стр.8_Разд.2.1"]["AW35"], f["стр.8_Разд.2.1"]["AZ35"])

        d1room = (f["стр.7_Разд.2.1"]["AE33"], f["стр.7_Разд.2.1"]["AH33"], f["стр.7_Разд.2.1"]["AK33"],
                  f["стр.7_Разд.2.1"]["AN33"], f["стр.7_Разд.2.1"]["AQ33"], f["стр.7_Разд.2.1"]["AT33"],
                  f["стр.7_Разд.2.1"]["AW33"], f["стр.7_Разд.2.1"]["AZ33"])

        d2room = (f["стр.8_Разд.2.1"]["AE37"], f["стр.8_Разд.2.1"]["AH37"], f["стр.8_Разд.2.1"]["AK37"],
                  f["стр.8_Разд.2.1"]["AN37"], f["стр.8_Разд.2.1"]["AQ37"], f["стр.8_Разд.2.1"]["AT37"],
                  f["стр.8_Разд.2.1"]["AW37"], f["стр.8_Разд.2.1"]["AZ37"])

        for _ in range(len(data["AutoCalcDevice"]["device1"]["room"])):
            d1house[_].value = data["AutoCalcDevice"]["device1"]["house"][_]
            d1camp[_].value = data["AutoCalcDevice"]["device1"]["campus"][_]
            d1room[_].value = data["AutoCalcDevice"]["device1"]["room"][_]

            d2house[_].value = data["AutoCalcDevice"]["device2"]["house"][_]
            d2camp[_].value = data["AutoCalcDevice"]["device2"]["campus"][_]
            d2room[_].value = data["AutoCalcDevice"]["device2"]["room"][_]

        d1place1 = (f["стр.8_Разд.2.1"]["BA9"], f["стр.8_Разд.2.1"]["BD9"], f["стр.8_Разд.2.1"]["BG9"],
                    f["стр.8_Разд.2.1"]["BJ9"], f["стр.8_Разд.2.1"]["BM9"], f["стр.8_Разд.2.1"]["BP9"],
                    f["стр.8_Разд.2.1"]["BS9"], f["стр.8_Разд.2.1"]["BV9"], f["стр.8_Разд.2.1"]["BY9"],
                    f["стр.8_Разд.2.1"]["CB9"], f["стр.8_Разд.2.1"]["CE9"], f["стр.8_Разд.2.1"]["CH9"],
                    f["стр.8_Разд.2.1"]["CK9"], f["стр.8_Разд.2.1"]["CN9"], f["стр.8_Разд.2.1"]["CQ9"],
                    f["стр.8_Разд.2.1"]["CT9"], f["стр.8_Разд.2.1"]["CW9"], f["стр.8_Разд.2.1"]["CZ9"],
                    f["стр.8_Разд.2.1"]["DC9"], f["стр.8_Разд.2.1"]["DF9"])

        d2place1 = (f["стр.8_Разд.2.1"]["BA40"], f["стр.8_Разд.2.1"]["BD40"], f["стр.8_Разд.2.1"]["BG40"],
                    f["стр.8_Разд.2.1"]["BJ40"], f["стр.8_Разд.2.1"]["BM40"], f["стр.8_Разд.2.1"]["BP40"],
                    f["стр.8_Разд.2.1"]["BS40"], f["стр.8_Разд.2.1"]["BV40"], f["стр.8_Разд.2.1"]["BY40"],
                    f["стр.8_Разд.2.1"]["CB40"], f["стр.8_Разд.2.1"]["CE40"], f["стр.8_Разд.2.1"]["CH40"],
                    f["стр.8_Разд.2.1"]["CK40"], f["стр.8_Разд.2.1"]["CN40"], f["стр.8_Разд.2.1"]["CQ40"],
                    f["стр.8_Разд.2.1"]["CT40"], f["стр.8_Разд.2.1"]["CW40"], f["стр.8_Разд.2.1"]["CZ40"],
                    f["стр.8_Разд.2.1"]["DC40"], f["стр.8_Разд.2.1"]["DF40"])

        d1place2 = (f["стр.8_Разд.2.1"]["BA11"], f["стр.8_Разд.2.1"]["BD11"], f["стр.8_Разд.2.1"]["BG11"],
                    f["стр.8_Разд.2.1"]["BJ11"], f["стр.8_Разд.2.1"]["BM11"], f["стр.8_Разд.2.1"]["BP11"],
                    f["стр.8_Разд.2.1"]["BS11"], f["стр.8_Разд.2.1"]["BV11"], f["стр.8_Разд.2.1"]["BY11"],
                    f["стр.8_Разд.2.1"]["CB11"], f["стр.8_Разд.2.1"]["CE11"], f["стр.8_Разд.2.1"]["CH11"],
                    f["стр.8_Разд.2.1"]["CK11"], f["стр.8_Разд.2.1"]["CN11"], f["стр.8_Разд.2.1"]["CQ11"],
                    f["стр.8_Разд.2.1"]["CT11"], f["стр.8_Разд.2.1"]["CW11"], f["стр.8_Разд.2.1"]["CZ11"],
                    f["стр.8_Разд.2.1"]["DC11"], f["стр.8_Разд.2.1"]["DF11"])

        d2place2 = (f["стр.8_Разд.2.1"]["BA42"], f["стр.8_Разд.2.1"]["BD42"], f["стр.8_Разд.2.1"]["BG42"],
                    f["стр.8_Разд.2.1"]["BJ42"], f["стр.8_Разд.2.1"]["BM42"], f["стр.8_Разд.2.1"]["BP42"],
                    f["стр.8_Разд.2.1"]["BS42"], f["стр.8_Разд.2.1"]["BV42"], f["стр.8_Разд.2.1"]["BY42"],
                    f["стр.8_Разд.2.1"]["CB42"], f["стр.8_Разд.2.1"]["CE42"], f["стр.8_Разд.2.1"]["CH42"],
                    f["стр.8_Разд.2.1"]["CK42"], f["стр.8_Разд.2.1"]["CN42"], f["стр.8_Разд.2.1"]["CQ42"],
                    f["стр.8_Разд.2.1"]["CT42"], f["стр.8_Разд.2.1"]["CW42"], f["стр.8_Разд.2.1"]["CZ42"],
                    f["стр.8_Разд.2.1"]["DC42"], f["стр.8_Разд.2.1"]["DF42"])

        d1place3 = (f["стр.8_Разд.2.1"]["BA13"], f["стр.8_Разд.2.1"]["BD13"], f["стр.8_Разд.2.1"]["BG13"],
                    f["стр.8_Разд.2.1"]["BJ13"], f["стр.8_Разд.2.1"]["BM13"], f["стр.8_Разд.2.1"]["BP13"],
                    f["стр.8_Разд.2.1"]["BS13"], f["стр.8_Разд.2.1"]["BV13"], f["стр.8_Разд.2.1"]["BY13"],
                    f["стр.8_Разд.2.1"]["CB13"], f["стр.8_Разд.2.1"]["CE13"], f["стр.8_Разд.2.1"]["CH13"],
                    f["стр.8_Разд.2.1"]["CK13"], f["стр.8_Разд.2.1"]["CN13"], f["стр.8_Разд.2.1"]["CQ13"],
                    f["стр.8_Разд.2.1"]["CT13"], f["стр.8_Разд.2.1"]["CW13"], f["стр.8_Разд.2.1"]["CZ13"],
                    f["стр.8_Разд.2.1"]["DC13"], f["стр.8_Разд.2.1"]["DF13"])

        d2place3 = (f["стр.8_Разд.2.1"]["BA44"], f["стр.8_Разд.2.1"]["BD44"], f["стр.8_Разд.2.1"]["BG44"],
                    f["стр.8_Разд.2.1"]["BJ44"], f["стр.8_Разд.2.1"]["BM44"], f["стр.8_Разд.2.1"]["BP44"],
                    f["стр.8_Разд.2.1"]["BS44"], f["стр.8_Разд.2.1"]["BV44"], f["стр.8_Разд.2.1"]["BY44"],
                    f["стр.8_Разд.2.1"]["CB44"], f["стр.8_Разд.2.1"]["CE44"], f["стр.8_Разд.2.1"]["CH44"],
                    f["стр.8_Разд.2.1"]["CK44"], f["стр.8_Разд.2.1"]["CN44"], f["стр.8_Разд.2.1"]["CQ44"],
                    f["стр.8_Разд.2.1"]["CT44"], f["стр.8_Разд.2.1"]["CW44"], f["стр.8_Разд.2.1"]["CZ44"],
                    f["стр.8_Разд.2.1"]["DC44"], f["стр.8_Разд.2.1"]["DF44"])

        for _ in range(len(data["AutoCalcDevice"]["device1"]["place"][0])):
            d1place1[_].value = data["AutoCalcDevice"]["device1"]["place"][0][_]
            d1place2[_].value = data["AutoCalcDevice"]["device1"]["place"][1][_]
            d1place3[_].value = data["AutoCalcDevice"]["device1"]["place"][2][_]

            d2place1[_].value = data["AutoCalcDevice"]["device2"]["place"][0][_]
            d2place2[_].value = data["AutoCalcDevice"]["device2"]["place"][1][_]
            d2place3[_].value = data["AutoCalcDevice"]["device2"]["place"][2][_]

    f.save(path)


if __name__ == "__main__":
    print("".join("12:48".split(":")))
